{
	"projects": [
		{
			"name": "Achilles",
			"description": [
				"Integrated running data with the Strava API including creating an Express.js server to handle Strava's OAuth authentication system.",
				"Learnt to use MongoDB databases and schemas in order to store data fetched from Discord and Strava.",
				"Used the DiscordJS library to handle user commands that display weekly leaderboards, graphs comparing different runners (Chart.js) and personalised user statistics."
			],
			"summary": "My first personal project, created during COVID-90 lockdown period, features a Discord Bot that displays a weekly leaderboard for running communities.",
			"link": "https://github.com/felixc90/Strava-Discord-Bot",
			"technologies": ["JavaScript", "Discord.js", "MongoDB"],
			"image": "/images/achilles.png",
			"alt": "Image of Achilles Discord Bot in use"
		},
		{
			"name": "Portfolio",
			"description": [
				"Researched various websites on awwwards.com to better understand web design",
				"Used React and worked with the Tailwind framework and Shadcn components to use utility-based styling and customisable UI components respectively",
				"Learnt Blender and Three.js to create and display interactive 3D models of University of New South Wales and various logos on the web",
				"Developed with GSAP to further add animated effects to the website"
			],
			"summary": "My latest personal project combines React.js, Three.js and Tailwind to help showcase everything about me from my education and work experiences to my personal projects.",
			"link": "https://github.com/felixc90/portfolio-website",
			"technologies": ["React.js", "Three.js", "Tailwind"],
			"image": "/images/portfolio.png",
			"alt": "Image of 3D Model of UNSW from Portfolio website"
		},
		{
			"name": "Buckets",
			"description": [
				"Worked in a team of six during the UniHack hackathon to produce a web-based platform that allows users to add items to their bucket list https://devpost.com/software/buckets|(Devpost)",
				"Originally written with Node.js and React.js, this project is currently being reworked with Java and React Native to produce a easy-to-use mobile app",
				"Our MVP consists of features including event creation on personal calendars and browser extension support",
				"My responsibilities have included writing up the Spring Boot application and integrating the Hibernate ORM."
			],
			"summary": "Starting from a hackathon idea, Buckets is a platform that helps people plan events with friends by centralising ideas found from different sources like Instagram and Youtube. [Work In Progress]",
			"link": "https://github.com/MagentaM3/Buckets",
			"technologies": ["Java", "Spring Boot", "React Native", "PostGreSQL"],
			"image": "/images/buckets.jpg",
			"alt": "Image of Buckets landing page"
		},

		{
			"name": "WorkWaves",
			"description": [
				"Learnt a range of technologies including TypeScript for type safety, DrizzleORM for performant SQL queries and tRPC middleware to ensure type compliance between the backend and frontend",
				"Created custom UI components using Radix UI and used Stitches, a CSS-in-JS library, for near-zero runtime styling",
				"Main responsibilities include designing the page for creating, deleting and modifying projects as well as video interview functionality"
			],
			"summary": "Over the course of 2.5 months, I worked with a team of five to create WorkWaves — a platform that connects professionals and companies advertising projects. [Capstone Project]",
			"link": "https://docs.google.com/document/d/1m9QaW7mSP9jG-Zk3LgHHsKBdsYDZca6zZxXBy49jUII/edit?usp=sharing",
			"technologies": ["Node.js", "Express.js", "React", "PostGreSQL"],
			"image": "/images/workwaves.png",
			"alt": "Image of WorkWaves landing page"
		}
	]
}